In [1]:
import plotly.express as px
import plotly.graph_objects as go
import matplotlib
import matplotlib.pyplot as plt
import matplotlib.ticker as ticker
import datetime as dt
import numpy as np
import pandas as pd
from pandas.api.types import CategoricalDtype
import seaborn as sns
import sqlite3

# warnings
import warnings
warnings.filterwarnings('ignore',category=FutureWarning)

# Hide warning temporarily
pd.options.mode.chained_assignment = None

In [2]:
df = pd.read_csv("data/flights_sample_2m.csv")

In [3]:
dow_category = CategoricalDtype(categories=["Monday", "Tuesday", "Wednesday", "Thursday", "Friday",
                                            "Saturday", "Sunday"], ordered=True)

df["FL_DATE"] = pd.to_datetime(df["FL_DATE"])
df["YEAR"] = df["FL_DATE"].dt.year
df["MONTH"] = df["FL_DATE"].dt.month
df["QUARTER"] = ((df["MONTH"] -1)//3)+1
df["DAY_OF_WEEK"] = df["FL_DATE"].dt.dayofweek.map({0: 'Monday', 1: 'Tuesday', 2: 'Wednesday', 3: 'Thursday',
                                                     4: 'Friday', 5: 'Saturday', 6: 'Sunday'}).astype(dow_category)

df["DISTANCE_CAT"] = pd.cut(
    df["DISTANCE"], bins = [-1, 500, 1500, float("inf")],
    labels = ["Short-haul", "Medium-haul", "Long-haul"]
)

In [4]:
# Tạo file database mới (nếu chưa có)
conn = sqlite3.connect("flights.db")  # file sẽ tự động tạo

# Ghi DataFrame vào SQLite
df.to_sql("flights", conn, if_exists="replace", index=False)

2000000

In [5]:
query_1 = """
SELECT R1.TOTAL_FLIGHTS, R2.N_DELAYED_FLIGHTS, R3.N_CANCELLED_FLIGHTS, R4.N_DIVERTED_FLIGHTS, R5.N_ONTIME_FLIGHTS
FROM (SELECT printf("%,d", COUNT(*)) AS TOTAL_FLIGHTS FROM flights) R1
JOIN (SELECT printf("%,d", COUNT(*)) AS N_DELAYED_FLIGHTS FROM flights WHERE ARR_DELAY > 15) R2
JOIN (SELECT printf("%,d", COUNT(*)) AS N_CANCELLED_FLIGHTS FROM flights WHERE CANCELLED == 1) R3
JOIN (SELECT printf("%,d", COUNT(*)) AS N_DIVERTED_FLIGHTS FROM flights WHERE DIVERTED == 1) R4
JOIN (SELECT printf("%,d", COUNT(*)) AS N_ONTIME_FLIGHTS FROM flights WHERE ARR_DELAY <=15) R5
"""
result_1 = pd.read_sql(query_1, conn)
result_1

,TOTAL_FLIGHTS,N_DELAYED_FLIGHTS,N_CANCELLED_FLIGHTS,N_DIVERTED_FLIGHTS,N_ONTIME_FLIGHTS
0,"2,000,000","343,875","52,522","4,709","1,598,894"

In [6]:
query_2 = """
SELECT DISTINCT AIRLINE
FROM flights
ORDER BY AIRLINE;
"""
result_2 = pd.read_sql(query_2, conn)
result_2

                               AIRLINE
0                 Alaska Airlines Inc.
1                        Allegiant Air
2               American Airlines Inc.
3                 Delta Air Lines Inc.
4                    Endeavor Air Inc.
5                            Envoy Air
6   ExpressJet Airlines LLC d/b/a aha!
7               Frontier Airlines Inc.
8               Hawaiian Airlines Inc.
9                          Horizon Air
10                     JetBlue Airways
11                  Mesa Airlines Inc.
12                   PSA Airlines Inc.
13                    Republic Airline
14               SkyWest Airlines Inc.
15              Southwest Airlines Co.
16                    Spirit Air Lines
17               United Air Lines Inc.

In [10]:
query_3 = """
SELECT YEAR, printf("%,d", COUNT(*)) AS TOTAL_FLIGHTS
FROM flights
GROUP BY YEAR;
"""
result_3 = pd.read_sql(query_3, conn)
result_3

   YEAR TOTAL_FLIGHTS
0  2019       505,345
1  2020       318,768
2  2021       407,824
3  2022       457,760
4  2023       310,303

In [11]:
query_4 = """
SELECT YEAR, MONTH, printf("%,d", COUNT(*)) AS TOTAL_FLIGHTS
FROM flights
GROUP BY YEAR, MONTH;
"""
result_4 = pd.read_sql(query_4, conn)
result_4

    YEAR  MONTH TOTAL_FLIGHTS
0   2019      1        39,568
1   2019      2        35,912
2   2019      3        43,208
3   2019      4        41,136
4   2019      5        43,293
5   2019      6        43,584
6   2019      7        44,850
7   2019      8        45,015
8   2019      9        41,281
9   2019     10        43,438
10  2019     11        40,990
11  2019     12        43,070
12  2020      1        40,937
13  2020      2        39,308
14  2020      3        44,272
15  2020      4        21,190
16  2020      5        12,322
17  2020      6        15,371
18  2020      7        23,869
19  2020      8        25,700
20  2020      9        21,946
21  2020     10        24,011
22  2020     11        24,790
23  2020     12        25,052
24  2021      1        24,715
25  2021      2        22,820
26  2021      3        30,017
27  2021      4        30,928
28  2021      5        33,619
29  2021      6        37,213
30  2021      7        39,591
31  2021      8        39,288
32  2021      9        36,712
33  2021     10        38,102
34  2021     11        37,266
35  2021     12        37,553
36  2022      1        36,650
37  2022      2        33,301
38  2022      3        38,646
39  2022      4        37,941
40  2022      5        39,184
41  2022      6        39,273
42  2022      7        40,677
43  2022      8        40,105
44  2022      9        38,118
45  2022     10        38,929
46  2022     11        37,001
47  2022     12        37,935
48  2023      1        36,743
49  2023      2        34,545
50  2023      3        39,709
51  2023      4        38,300
52  2023      5        39,656
53  2023      6        39,175
54  2023      7        40,813
55  2023      8        41,362

In [12]:
query_5 = """
SELECT YEAR, printf("%,d", COUNT(*)) AS TOTAL_FLIGHTS
FROM flights
WHERE AIRLINE == 'Envoy Air'
GROUP BY YEAR;
"""
result_5 = pd.read_sql(query_5, conn)
result_5

   YEAR TOTAL_FLIGHTS
0  2019        22,111
1  2020        14,435
2  2021        17,665
3  2022        16,823
4  2023        10,111

In [13]:
query_6 = """
SELECT YEAR, MONTH, printf("%,d", COUNT(*)) AS TOTAL_FLIGHTS
FROM flights
WHERE AIRLINE == 'Envoy Air'
GROUP BY YEAR, MONTH;
"""
result_6 = pd.read_sql(query_6, conn)
result_6

    YEAR  MONTH TOTAL_FLIGHTS
0   2019      1         1,751
1   2019      2         1,531
2   2019      3         1,785
3   2019      4         1,761
4   2019      5         1,933
5   2019      6         1,923
6   2019      7         1,999
7   2019      8         2,106
8   2019      9         1,877
9   2019     10         1,875
10  2019     11         1,725
11  2019     12         1,845
12  2020      1         1,781
13  2020      2         1,670
14  2020      3         1,829
15  2020      4         1,002
16  2020      5           650
17  2020      6           825
18  2020      7         1,177
19  2020      8         1,137
20  2020      9         1,054
21  2020     10         1,137
22  2020     11         1,066
23  2020     12         1,107
24  2021      1         1,250
25  2021      2         1,144
26  2021      3         1,365
27  2021      4         1,322
28  2021      5         1,505
29  2021      6         1,612
30  2021      7         1,631
31  2021      8         1,661
32  2021      9         1,493
33  2021     10         1,556
34  2021     11         1,609
35  2021     12         1,517
36  2022      1         1,526
37  2022      2         1,357
38  2022      3         1,464
39  2022      4         1,552
40  2022      5         1,424
41  2022      6         1,374
42  2022      7         1,538
43  2022      8         1,483
44  2022      9         1,298
45  2022     10         1,331
46  2022     11         1,168
47  2022     12         1,308
48  2023      1         1,287
49  2023      2         1,195
50  2023      3         1,260
51  2023      4         1,214
52  2023      5         1,240
53  2023      6         1,169
54  2023      7         1,338
55  2023      8         1,408